---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures.ComponentRepeater_InvalidFamilyOnReload
source: html/bad63c5a-9a05-9fca-3cf7-dd9ad8bd85d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures.ComponentRepeater_InvalidFamilyOnReload Property

Reloaded family not appropriate for repeater.

## Syntax (C#)
```csharp
public static FailureDefinitionId ComponentRepeater_InvalidFamilyOnReload { get; }
```